app/controllers/subscriptions_controller.rb

  def create
    begin
      @user=User.new

      @user = @user.create_tenant_user!(params[:email],
                                        params[:password],
                                        params[:password_confirmation],
                                        params[:company_name])
---
INSERT INTO "tenants" ("company_name", "created_at", "customer_email", "customer_first_name", "customer_last_name", "customer_phone", "edition", "expire_at", "subscription_reference", "subscription_status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("confirmed", "created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login_count", "password_salt", "perishable_token", "persistence_token", "single_access_token", "status", "tenant_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)